#+TITLE: setting up hasura using containers

* TODO write out hasura.conf
Document how to use hasura cli / console remotely.

#+BEGIN_SRC yaml :tangle ../hasura/config.yaml
endpoint: http://sharing.io:8888
#+END_SRC

* TADA write out the docker-compose.yaml

#+BEGIN_SRC yaml :tangle ../hasura/docker-compose.yaml
  # hasura/docker-compose.yaml
  version: "2.1"

  services:
    ${USER}-hasura:
      #image: hasura/graphql-engine:v1.0.0-beta.3
      # append '.cli-migrations' to auto run 'hasura migrations apply'
      image: hasura/graphql-engine:v1.0.0-beta.4.cli-migrations
      restart: always
      networks:
        - web
      environment:
        # Should try and set database be read only for public
        #- HASURA_GRAPHQL_DATABASE_URL=postgres://non-priv-user@172.17.0.1:5432/database-name
        #- HASURA_GRAPHQL_DATABASE_URL=postgres://non-priv-user@172.17.0.1:5432/$OUTER-USER
        # https://docs.docker.com/compose/compose-file/#variable-substitution
        # https://docs.docker.com/compose/env-file/
        - "HASURA_GRAPHQL_DATABASE_URL=postgres://${USER}@172.17.0.1:5432/${USER}"
        - HASURA_GRAPHQL_ENABLE_CONSOLE=true
      volumes:
        - ./migrations:/hasura-migrations
      expose:
        - "8080"
      labels:
        - "traefik.docker.network=web"
        - "traefik.enable=true"
        - "traefik.basic.port=8080"
        - "traefik.basic.protocol=http"
        - "traefik.basic.frontend.rule=Host:${USER}-hasura.sharing.io"
  #volumes:
  #  migrations:
  networks:
    web:
      external: true
#+END_SRC
* TODO stop/start container

#+BEGIN_SRC shell :dir ../hasura
docker-compose start
#+END_SRC

#+BEGIN_SRC shell :dir ../hasura
docker-compose ps
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
      Name                     Command               State    Ports  
---------------------------------------------------------------------
hasura_zzhasura_1   docker-entrypoint.sh graph ...   Up      8080/tcp
#+end_EXAMPLE

* TODO link to traefik setup for entire box


